In [1]:
import numpy as np
import pandas as pd

In [4]:
#Criação do dataframe em string de proposito
df = pd.DataFrame({
    'idade': ['30','25','28','35','40'],
    'salario':['1000','1250','2500','2840', '5800']
})
df

  idade salario
0    30    1000
1    25    1250
2    28    2500
3    35    2840
4    40    5800

In [5]:
#Descricao dos dados
df.describe()

       idade salario
count      5       5
unique     5       5
top       30    1000
freq       1       1

In [6]:
df.info()
#df info mostra corretamente

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   idade    5 non-null      object
 1   salario  5 non-null      object
dtypes: object(2)
memory usage: 212.0+ bytes

In [9]:
#Mudar agora a estrutura string para int
df['idade']=df['idade'].astype('int32')
df['salario']=df['salario'].astype('float')
df

   idade  salario
0     30   1000.0
1     25   1250.0
2     28   2500.0
3     35   2840.0
4     40   5800.0

In [10]:
#Agora verificar se funcionou com describe e info
df.describe()

          idade      salario
count   5.00000     5.000000
mean   31.60000  2678.000000
std     5.94138  1914.398078
min    25.00000  1000.000000
25%    28.00000  1250.000000
50%    30.00000  2500.000000
75%    35.00000  2840.000000
max    40.00000  5800.000000

In [11]:
#Metodo info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   idade    5 non-null      int32
 1   salario  5 non-null      float64
dtypes: float64(1), int32(1)
memory usage: 192.0 bytes

In [12]:
#Metodo to_numeric
#Criar novo dataframe
df = pd.DataFrame({
    'idade':['25','30','40','45']
})
df

  idade
0    25
1    30
2    40
3    45

In [13]:
#Usando metodo dtypes para verificar tipos antes do to_numeric
df.dtypes

idade    object
dtype: object

In [14]:
df['idade'] = pd.to_numeric(df['idade'])
df.dtypes

idade    int64
dtype: object

In [15]:
#Metodo to_datetime, transforma em tipo date
df = pd.DataFrame({
    'Data': ['25/05/2023', '30/06/2023', '15/09/2024']
})

df

         Data
0  25/05/2023
1  30/06/2023
2  15/09/2024

In [16]:
#Usando  metodo to_datetime
df['Data'] = pd.to_datetime(df['Data'], format='%d/%m/%Y')
df

        Data
0 2023-05-25
1 2023-06-30
2 2024-09-15

In [20]:
#Calculando diferenças em datas, criando dataframe em data de string
df = pd.DataFrame({
    'Atividade': ['A', 'B', 'C'],
    'Inicio_atividade': ['2023-05-01 09:00:00', '2023-05-02 14:30:00', '2023-05-03 10:15:00'],
    'Fim_atividade': ['2023-05-01 11:30:00', '2023-05-03 16:45:00', '2023-05-03 12:45:00']
})

df

  Atividade     Inicio_atividade        Fim_atividade
0         A  2023-05-01 09:00:00  2023-05-01 11:30:00
1         B  2023-05-02 14:30:00  2023-05-03 16:45:00
2         C  2023-05-03 10:15:00  2023-05-03 12:45:00

In [21]:
#Convertendo as colunas de datas para tipo datetime
df['Inicio_atividade'] = pd.to_datetime(df['Inicio_atividade'])
df['Fim_atividade'] = pd.to_datetime(df['Fim_atividade'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Atividade         3 non-null      object
 1   Inicio_atividade  3 non-null      datetime64[ns]
 2   Fim_atividade     3 non-null      datetime64[ns]
dtypes: datetime64[ns](2), object(1)
memory usage: 204.0+ bytes

In [22]:
#Calculando a diferença entre as datas
df['Duracao_atividade'] = df['Fim_atividade'] - df['Inicio_atividade']
df.head()

  Atividade    Inicio_atividade       Fim_atividade Duracao_atividade
0         A 2023-05-01 09:00:00 2023-05-01 11:30:00   0 days 02:30:00
1         B 2023-05-02 14:30:00 2023-05-03 16:45:00   1 days 02:15:00
2         C 2023-05-03 10:15:00 2023-05-03 12:45:00   0 days 02:30:00